/*******************************************************************
*
*    FILENAME(文件名)     :    SENSOR_SINGLE_LINE.H
*
*    COPYRIGHT(著作权)    :    深圳市讯方通信技术有限公司
*
*    MODULE NAME(组件名)  :
*
*    CPU                  :    stm32F103ZET6
*
*    RTOS(操作系统)       :    
*
*    CreateDate(创建时间) :
*
*    AUTHOR(作者)         :    
*
*    Abstract Description 
*    摘要描述             :
*
*--------------------------Revision History------------------------
*
*    No    Version    Date    Revise By    Item    Description
*
*******************************************************************/

/*******************************************************************
*    Multi-Include-Prevent Section
*******************************************************************/
#ifndef __SENSOR_SINGLE_LINE_H__
#define __SENSOR_SINGLE_LINE_H__
/*******************************************************************
*    Debug switch Section
*    调试开关
*******************************************************************/

/*******************************************************************
*    Include File Section
*    包含头文件
*******************************************************************/

#include <includes.h>
/*******************************************************************
*    Macro Define Section
*    宏定义 
*******************************************************************/
//======================================================================
////BO-B1 --IO0-IO1
////B7 - TTL电平	IO2
////C0 - SENSER-OUT		C1-参考电压


#define   DS18B20_PIN                      GPIO_PIN_13
#define   DS18B20_PORT                     GPIOC
#define   DS18B20_MODE                     GPIO_MODE_OUTPUT_PP
#define   DS18B20_PULL                     GPIO_PULLUP


//IO方向设置
#define DS18B20_IO_IN()  {DS18B20_PORT->MODER&=~(3<<(13*2));DS18B20_PORT->MODER|=0<<13*2;}
#define DS18B20_IO_OUT() {DS18B20_PORT->MODER&=~(3<<(13*2));DS18B20_PORT->MODER|=1<<13*2;} 

////IO操作函数	
#define	DS18B20_DQ        PCout(13)
#define	DS18B20_DQ_SET    {DS18B20_DQ =1;}//数据端口 PC13
#define	DS18B20_DQ_CLR    {DS18B20_DQ =0;}

#define	DS18B20_DQ_IN  ((DS18B20_PORT->IDR&DS18B20_PIN)>>13)  //数据端口	PC13


/*******************************************************************
*    Struct Define Section
*    结构体定义
*******************************************************************/

/*******************************************************************
*    Global Varible Declare
*    全局变量声明
*******************************************************************/

/*******************************************************************
*    Prototype Declare Section
*    内部函数原型声明
*******************************************************************/
u8 DS18B20_Init(void);
void DS18B20_Get_Temp(u8* data);

#endif

