/*******************************************************************
*
*    FILENAME(文件名)     :    sensor.c
*
*    COPYRIGHT(著作权)    :    深圳市讯方通信技术有限公司
*
*    MODULE NAME(组件名)  :
*
*    CPU                  :    stm32F103ZET6
*
*    RTOS(操作系统)       :    
*
*    CreateDate(创建时间) :
*
*    AUTHOR(作者)         :
*
*    Abstract Description 
*    摘要描述             :    倾斜、凝露传感器函数
*
*--------------------------Revision History------------------------
*
*    No    Version    Date    Revise By    Item    Description
*
*******************************************************************/

/*******************************************************************
*    Debug switch Section
*    调试开关
*******************************************************************/

/*******************************************************************
*    Include File Section
*    包含头文件
*******************************************************************/
#include "sensor.h"
/*******************************************************************
*    Macro Define Section
*    宏定义
*******************************************************************/

/*******************************************************************
*    Struct Define Section
*    结构体定义
*******************************************************************/

/*******************************************************************
*    Global variables defined
*    全局变量定义
*******************************************************************/
u8 sensor_exit_flag = 0;
/*******************************************************************
*    External Varible Declare
*    外部变量声明
*******************************************************************/

/*******************************************************************
*    Function Define Section
*    函数定义部分
*******************************************************************/

/*****************************************************************
*    Function Name(函数名)   :   senser_Init(u8 type)
*
*    Parameters(参数)        :   传感器类型
*
*    Description(描述)       :   不同传感器的初始化工作
*
*    Returns(返回值)         :
*
*    Global Variable         
*    全局变量                :
*    File Static Variable    
*    本文件静态变量          :
*    Function Static Variable
*    函数静态变量            :
*----------------------------------------------------------------
*    Revision History(修改历史记录)
*    No.    Date        Revised by        Item        Description
*
*****************************************************************/
void senser_Init(u8 type)
{
	switch(type)
	{
       case SENSOR_DS18B20:	   	    //判断温度传感器 			
           DS18B20_Init();			//初始化温度传感器
           break;
  
       default:
           break;
	}	
}

/*****************************************************************
*    Function Name(函数名)   :   sensor_get_data(u8 type,u8* data)
*
*    Parameters(参数)        :   传感器类型，采集的数据存储位置
*
*    Description(描述)       :
*
*    Returns(返回值)         :
*
*    Global Variable         
*    全局变量                :
*    File Static Variable    
*    本文件静态变量          :
*    Function Static Variable
*    函数静态变量            :
*----------------------------------------------------------------
*    Revision History(修改历史记录)
*    No.    Date        Revised by        Item        Description
*
*****************************************************************/
u8 sensor_get_data(u8 type,u8* data1)
{
	u8* data = &data1[1];
	u8 no_sensor = 1;					//有无传感器判断标志
 	*data1 =  type;						//类型匹配

    //************ 传感器采集数据 ************//
	switch(type)
		{
        case SENSOR_DS18B20:	   	    //判断温度传感器 	
            DS18B20_Get_Temp(data);		//采集温度
            break;

        default:
			no_sensor = 0;
            break;
		}
  return no_sensor;
}
